Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱིས། བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་དེ་བཞིན་གཤེགས་པ་རྣམ་པར་སྣང་མཛད་ཀྱི་སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་རྒྱ་མཚོ་དེ་དག་ལ་རབ་ཏུ་འཇུག་གོ །སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་དུ་རྒྱས་པར་འགེངས་པར་འཇུག་པའི་ཚུལ་གྱིས་སྔོན་བསྐལ་པ་མཉམ་པར་སྤྱད་པ་ཡང་རྗེས་སུ་དྲན་ནོ། །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཛེ་ཏའི་ཚལ་དུ་ཕྱིན་ཅིང་། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔ་ན་འཁོད་པ། སེང་གེའི་ཁྲི་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་པད་མོའི་སྙིང་པོ་ཅན་འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་དང་མཉམ་པར་ཡངས་པ་ལ་འཁོད་པ། ཡེ་ཤེས་དང་མངོན་པར་ཤེས་པ་ཆེན་པོའི་རྣམ་པར་འཕྲུལ་པས་བྱུང་བ། ཡེ་ཤེས་དང་མངོན་པར་ཤེས་པ་རྣོ་བ་དང་ལྡན་པའི་ས་རྗེས་སུ་ཐོབ་པ། ཡེ་ཤེས་ཀྱིས་ཀུན་ཏུ་རྣམ་པར་དཔྱོད་པ། ཤེས་རབ་ཀྱི་འབྱུང་གནས་ཀྱི་རིགས་སུ་བྱུང་བ། ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ལ་མངོན་དུ་གྱུར་པ། ཡེ་ཤེས་ཀྱི་མིག་རབ་རིབ་མེད་པ་དང་ལྡན་པ། སེམས་ཅན་གྱི་ཁ་ལོ་བསྒྱུར་བའི་རང་བཞིན་ཐོབ་པ། སངས་རྒྱས་ཐམས་ཅད་དང་མཉམ་པ་ཉིད་ཀྱི་རྗེས་སུ་སོང་བ། རྟག་ཏུ་རྣམ་པར་རྟོག་པ་མེད་པར་ཆོས་ལ་སྤྱོད་པ། ཆོས་ཀྱི་དམྱིགས་པ་ཐམས་ཅད་རབ་ཏུ་རྟོགས་པ། ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་ཞི་བར་དམིགས་པ་འཇིག་རྟེན་ཐམས་ཅད་ཤིན་ཏུ་ཞི་བས། གནས་ཐ་དད་པ་མེད་པ་ལ་རབ་ཏུ་གཞོལ་བ། འཇིག་རྟེན་ཐ་དད་པ་ཐམས་ཅད་དུ་རབ་ཏུ་ཞུགས་པ། གནས་མེད་པར་ཞིང་ཐམས་ཅད་དུ་འདོང་བ། ཆོས་ཀྱི་གནས་ཐམས་ཅད་ལ་བརྟེན་པ་མེད་པར་ཆོས་ཐམས་ཅད་བླ་གབ་མེད་པའི་གཞལ་མེད་ཁང་དུ་ཕྱིན་པ། འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བ་ལ་ཞུགས་པ་སེམས་ཅན་ཐམས་ཅད་ལ་བདེ་བའི་ལམ་སྟོན་པ། ཡེ་ཤེས་དང་རྣམ་པར་ཐར་པ་ཤིན་ཏུ་འཕགས་པའི་གནས་ཀྱི་སྤྱོད་ཡུལ་ཅན། འདོད་ཆགས་དང་བྲལ་བའི་མཐར་ཕྱིན་པའི་ཡེ་ཤེས་ཀྱི་ལུས་དང་ལྡན་པ། སྲིད་པའི་རྒྱ་མཚོ་ཐམས་ཅད་ལས་གྱེན་དུ་འཕགས་པ། འགྲོ་བ་ཐམས་ཅད་ལ་ཡང་དག་པའི་མཐའ་རྣམ་པར་སྟོན་པ། ཆོས་རྒྱ་མཚོ་ཤེས་རབ་སྣང་བའི་དཀྱིལ་འཁོར་ཅན། ཏིང་ངེ་འཛིན་གང་ཆེན་མཚོ་དང་ལྡན་པའི་དབྱིངས་ལ་ཤིན་ཏུ་མཉམ་པར་བཞག་ཅིང་། སྙིང་རྗེ་ཆེན་པོ་རབ་ཏུ་སེམས་པ། ཆོས་ཀྱི་ཚུལ་སྒྱུ་མའི་རྣམ་པ་འདི་ལྟ་བུ་རབ་ཏུ་རྟོགས་པ། འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ལ་རྨི་ལམ་ལྟ་བུར་ཞུགས་པ། དེ་བཞིན་གཤེགས་པ་མཐོང་བ་ཐམས་ཅད་མིག་ཡོར་ལྟ་བུར་ཁོང་དུ་ཆུད་པ། སྒྲ་སྐད་དང་དབྱངས་ཐམས་ཅད་སྒྲ་བརྙན་ལྟ་བུར་རྣམ་པར་རིག་པ། ཆོས་ཐམས་ཅད་མངོན་པར་སྒྲུབ་པའི་ཡེ་ཤེས་སྤྲུལ་པ་ལྟ་བུ་རབ་ཏུ་རྟོགས་པ། ཁྱད་པར་དུ་འཕགས་པའི་སྨོན་ལམ་ཤིན་ཏུ་བསྩགས་པ། ཡེ་ཤེས་ཀྱི་དཀྱིལ་འཁོར་ཀུན་ནས་དག་པའི་མཁས་པ་དང་ལྡན་པ། སེམས་ཤིན་ཏུ་ཞི་ཞིང་རབ་ཏུ་ཞི་བ་དང་ལྡན་པ་གཟུངས་ཀྱི་རྒྱུད་ཐམས་ཅད་ཀྱི་ཡུལ་དང་ལྡན་པ། ཏིང་ངེ་འཛིན་གྱི་སྟོབས་ཀྱིས་དོགས་པ་མེད་པར་ཀུན་ནས་རབ་ཏུ་གནོན་པ་ཆོས་ཀྱི་དབྱིངས་ཀྱི་གནས་ཀྱི་མཐར་ཕྱིན་པའི་མིག་དང་ལྡན་པ། ཆོས་ཐམས་ཅད་ལ་དམིགས་པ་མེད་པར་རྣམ་པར་སྤྱོད་པ་རབ་ཏུ་ཐོབ་པ་ཤེས་རབ་རྒྱ་མཚོ་མཐའ་ཡས་པ་ལ་རྣམ་པར་སྤྱོད་པ། ཡེ་ཤེས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཕ་རོལ་ཏུ་སོང་བ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྟོབས་དང་། ཤུགས་ཐོབ་པ། རྫུ་འཕྲུལ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པས་འགྲོ་བ་ཐམས་ཅད་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཏིང་ངེ་འཛིན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དབང་དུ་གྱུར་པ། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་དོན་མཁས་པ་ལ་ཕྱིན་ཅི་ལོག་མེད་པའི་ཡེ་ཤེས་དང་ལྡན་པ། ཆོས་ཀྱི་མཛོད་དབྱེ་བའི་ཆོ་ག་ལ་མཁས་པ། ངེས་པའི་ཚིག་ཤེས་པ་ལ་མངོན་པར་མཁས་པ། སྤོབས་པའི་སྟོབས་དང་། ཆོས་ཀྱི་སྤྲིན་ཟད་མྱི་ཤེས་པ་དང་ལྡན་པ། མྱི་འཇིགས་པས་ཁྱུ་མཆོག་དང་སེང་གེའི་ང་རོ་འབྱིན་པ། གནས་མེད་པའི་ཆོས་ཀྱི་དགའ་བ་ལ་དགའ་བས་མོས་པ། ཆོས་ཐམས་ཅད་ལ་རབ་རིབ་མྱེད་པའི་མྱིག་གིས་ལྟ་བ། འཇིག་རྟེན་ཐམས་ཅད་ཀྱི་འབྱུང་བ་དང་། འཇིག་པ་ཤེས་པའི་ཟླ་བར་གྱུར་པ། ཤེས་རབ་ཀྱི་དཀྱིལ་འཁོར་གྱིས་བདེན་པའི་ཚུལ་ཐམས་ཅད་ལ་རྣམ་པར་སྤྱོད་པའི་འོད་ཟེར་ཅན། ཡེ་ཤེས་ཀྱི་རྡོ་རྗེ་བསོད་ནམས་ཀྱི་ཁོར་ཡུག་ཏུ་གྱུར་པ། དཔེར་བྱ་བ་ཐམས་ཅད་ལས་ཤིན་ཏུ་འདས་པ། ཆོས་ཐམས་ཅད་ལ་དབང་པོ་དང་ཡེ་ཤེས་ཀྱི་མྱུ་གུ་རབ་ཏུ་སྐྱེས་པ། དཔའ་བའི་རྒྱལ་མཚན་དང་ལྡན་པ། བདུད་ཐམས་ཅད་ཀྱི་རྒྱལ་མཚན་རབ་ཏུ་སྙོལ་བ་ལ་དཔའ་བ་ཡེ་ཤེས་མཐའ་ཡས་པའི་དཀྱིལ་འཁོར་གྱི་གཟི་བརྗིད་ཅན། འགྲོ་བ་ཐམས་ཅད་ལས་མངོན་པར་འཕགས་པའི་ལུས་དང་ལྡན་པ། ཆོས་ཐམས་ཅད་ལ་ཤེས་རབ་སྒྲིབ་པ་མེད་པར་ཟད་པ་དང་། མྱི་ཟད་པའི་མཐའི་ཡེ་ཤེས་ཀྱིས་རྣམ་པར་སངས་རྒྱས་པ། ཡང་དག་པའི་མཐའི་ཀུན་གྱི་མཐར་ཕྱིན་པ་ལ་གནས་པ། མཚན་མ་མེད་པ་ལ་རྣམ་པར་ལྟ་བའི་ཡེ་ཤེས་ཀྱི་མྱིག་མངོན་སུམ་ཅན། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐམས་ཅད་མངོན་པར་བསྒྲུབ་པའི་རྒྱུ་ལ་མཁས་པ། མྱི་གཉིས་པའི་ཡེ་ཤེས་ཀྱི་སྤྱོད་ཡུལ་དང་ལྡན་པ་འཇིག་རྟེན་གྱི་རྒྱུད་ཐམས་ཅད་ལ་རྣམ་པར་ལྟ་བ། སངས་རྒྱས་ཀྱི་ཞིང་གི་རྒྱུད་གནས་མྱེད་པ་ལ་ཐམས་ཅད་དུ་གཟུགས་བརྙན་སྣང་བར་གྱུར་པ། ཆོས་ཐམས་ཅད་ལ་མུན་པ་དང་རྣམ་པར་བྲལ་བ་ཡེ་ཤེས་ཀྱི་དཀྱིལ་འཁོར་མུན་པ་མྱེད་པ་ལ་རབ་ཏུ་ཞུགས་པ། ཕྱོགས་ཀུན་ཏུ་ཆོས་ཀྱི་སྣང་བ་རབ་ཏུ་བཀྱེ་བ། འགྲོ་བ་ཐམས་ཅད་ཀྱི་བསོད་ནམས་ཀྱི་ཞིང་མཆོག་ཏུ་གྱུར་པ། ཐོས་པ་དང་མཐོང་བ་དང་། སྨོན་ལམ་དོན་ཡོད་པའི་ཟླ་བ། བསོད་ནམས་ཀྱི་རི་རབ་འཇིག་རྟེན་ཐམས་ཅད་ལས་མངོན་པར་འཕགས་པ། ཕས་ཀྱི་རྒོལ་བའི་ཚོགས་ཐམས་ཅད་ཚར་གཅོད་པ་ལ་ཤིན་ཏུ་དཔའ་བ། སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་སྒྲ་སྐད་དང་དབྱངས་ཀྱི་ང་རོ་འབྱིན་པ། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སྐུ་མཐོང་བས་མྱི་ངོམས་པ། སངས་རྒྱས་ཀྱི་སྐུའི་གཟུགས་བརྙན་གྱི་དབང་བསྒྱུར་བ་དང་ལྡན་པ། འགྲོ་བ་གདུལ་བ་དང་མཐུན་པའི་ལུས་སུ་བྱིན་གྱིས་རློབ་པ། ཞིང་འབྱམ་ཀླས་པ་ཐམས་ཅད་དུ་ལུས་གཅིག་གིས་རྒྱས་པར་འགེངས་པ། མངོན་པར་འདུ་བྱ་བ་མྱེད་པའི་རྫུ་འཕྲུལ་གྱི་དཀྱིལ་འཁོར་ཡོངས་སུ་དག་པ། ཐོགས་པ་མྱེད་པར་འགྲོ་བའི་ཡེ་ཤེས་ཆེན་པོའི་ཐེག་པའི་གྲུ་དང་ལྡན་པ། ཡེ་ཤེས་ཀྱི་དཀྱིལ་འཁོར་གྱིས་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་དུ་ལུས་རབ་ཏུ་སྣང་བ། ཡེ་ཤེས་ཀྱི་ཉི་མ་འགྲོ་བ་ཐམས་ཅད་དུ་ཤར་བ། འགྲོ་བ་ཐམས་ཅད་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་དགའ་བའི་ཁ་དོག་དང་ལྡན་པ། འགྲོ་བ་ཐམས་ཅད་ཀྱི་བསམ་པ་དང་། དབང་པོ་རབ་ཏུ་རྟོགས་པའི་ཡེ་ཤེས་ཅན། ཆོས་ཐམས་ཅད་བསྒྲིབས་པ་མེད་པའི་ཡུལ་ཁོང་དུ་ཆུད་པ། ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་སྐྱེ་བ་མེད་པ་རྣམ་པར་རིག་པ་ཕྲ་བ་དང་ཡངས་པ་ཕན་ཚུན་དུ་ཡོངས་སུ་བསྡུ་བ་ལ་དབང་བསྒྱུར་བ་སངས་རྒྱས་ཀྱིས་ཟབ་མོའི་ཚུལ་ངེས་པར་རྟོགས་པ། དོན་ཟབ་མོའི་ཚིག་དང་། ཡི་གེའི་ཐ་སྙད་ལ་མཁས་པ། ཚིག་དང་ཡི་གེ་དང་། དོན་མྱི་ཟད་པ་རབ་ཏུ་བརྗོད་པ། མདོ་སྡེ་རྒྱ་མཚོ་ཐམས་ཅད་ཚིག་གཅིག་ཏུ་ཆུད་པར་རབ་ཏུ་སྟོན་པ། གཟུངས་དང་ཡེ་ཤེས་ཀྱི་ལུས་རྒྱ་ཆེན་པོ་བྱིན་གྱིས་རློབ་པ། བསྐལ་པ་མཐའ་ཡས་པར་ཡོངས་སུ་འཛིན་པའི་གཟུངས་དང་ལྡན་པའི་བྱིན་གྱི་རླབས་ཅན། སེམས་ཀྱི་སྐད་ཅིག་གཅིག་གིས་བསྐལ་པ་བརྗོད་དུ་མྱེད་པར་གནས་པ། རབ་ཏུ་རྟོགས་པའི་ཡེ་ཤེས་ཅན། སེམས་ཀྱི་སྐད་ཅིག་གཅིག་གིས་དུས་གསུམ་ཤེས་པས།
en: Those bodhisattvas, through entering the path of samādhis such as those, which were as numerous as the atoms in countless buddha realms, perceived the Tathāgata Vairocana’s oceans of miracles of buddhahood, and they remembered the same kinds of miracles that he had performed in the past, with their comprehension pervading the entirety of the realm of phenomena in each instant of mind.

source: འཇིག་རྟེན་ཐམས་ཅད་མངོན་པར་ཤེས་པ། ཆོས་ཀྱི་གཟུངས་ཀྱིས་སངས་རྒྱས་ཀྱི་ཆོས་རྒྱ་མཚོ་མཐའ་ཡས་པ་དྲན་ཞིང་སྤོབས་པ་འགྲོ་བ་ཐམས་ཅད་ཀྱིས་ཡེ་ཤེས་པར་འགྱུར་བའི་ཐབས་ཀྱིས་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་ལས་ཕྱིར་མྱི་ལྡོག་པ། སངས་རྒྱས་ཀྱི་ཡུལ་ལ་ཡེ་ཤེས་སྣང་བ་རབ་ཏུ་ཐོབ་པ། གྱ་ནོམ་པར་སྣང་བའི་ཏིང་ངེ་འཛིན་ལ་རྟག་ཏུ་མཉམ་པར་བཞག་པ། ཆགས་པ་མྱེད་པའི་མཐའི་ཆོས་ཐམས་ཅད་རབ་ཏུ་དབྱེ་བའི་ཡེ་ཤེས་ལ་མངོན་པར་མཁས་པ། ཆོས་ཐམས་ཅད་ལས་ཁྱད་པར་དུ་འཕགས་པའི་རྣམ་པར་འཕྲུལ་པའི་ཡུལ་ལ་ཡེ་ཤེས་ཀྱིས་རྣམ་པར་རྩེ་བ། དམིགས་པ་ཐམས་ཅད་རྒྱན་བཟང་པོར་བྱིན་གྱིས་རློབ་པ། ཆོས་ཀྱི་དབྱིངས་ཕྱོགས་མྱེད་པ་ལ་ཕྱོགས་ཀྱི་རྗེས་སུ་འབྲང་བས་རབ་ཏུ་ཞུགས་པ་ཕྱོགས་ཐམས་ཅད་རྣམ་པར་དབྱེ་བ་ཆོས་ཀྱི་དབྱིངས་ལ་ཡང་དག་པར་གཞོལ་བ་ཤིན་ཏུ་ཕྲ་བ་སྟེ། ཡངས་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་ལ་བྱང་ཆུབ་ཏུ་རྣམ་པར་འཚང་རྒྱ་བ། རང་བཞིན་ཁ་དོག་མྱེད་པ་ལས་ཁ་དོག་ཐམས་ཅད་ཡོངས་སུ་སྟོན་པ། ཕྱོགས་གཅིག་ལ་ཡང་དག་པར་གཞོལ་བ་དེ་ལྟ་བུའི་ཡོན་ཏན་དང་ཡེ་ཤེས་མཐའ་ཡས་པས་ཡང་དག་པར་བསྐྱེད་དེ། བསོད་ནམས་དང་ཡེ་ཤེས་ཀྱི་སྙིང་པོ་དང་ལྡན་པར་གྱུར་པ། སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་བསྟོད་པ་བསྔགས་པ་བཀུར་བ་ཚིག་དང་ཡི་གེ་མྱི་ཟད་པས་ཡོན་ཏན་དང་ལེགས་པ་བརྗོད་དུ་ཡོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཛེ་ཏའི་ཚལ་དུ་འདུས་ཏེ།
en: Those bodhisattvas had come to Jetavana and were assembled before the Bhagavat; they were seated upon lotuses made of various jewels in the centers of lion thrones, which were as extensive as world realms and as numerous as the atoms in ten buddha realms; they had appeared through the miracle of great wisdom and knowledge; they had attained the level of sharp wisdom and knowledge; they had completely analyzed through wisdom; they had appeared in the family that is the origin of wisdom; they were facing omniscient wisdom; they had the undimmed eyes of wisdom; they approached the equality of all buddhas; they continuously engaged with phenomena without conceptualization; they had understood all perceived phenomena; they had the perception of the peace that is the nature of all phenomena; they had the supreme basis for the nirvāṇa that is the pacification of all worlds; they were present in the variety of all worlds; they did not dwell anywhere but went to all realms; they were not based upon the level of phenomena; they were based within the divine palace of the unconcealed nature of all phenomena; they followed the disciplined conduct through which they ripened all beings; they taught all beings the path to bliss; they had the field of activity that is the abode of the superior wisdom and liberation; they had the wisdom bodies that have reached the apex of the absence of desire; they rose above the ocean of all existences; they revealed the summit of existence to all beings; they had the disk that illuminated the ocean of the Dharma; they rested in the essence of the samādhi that is like an ocean; they had minds endowed with great compassion; they had realized the nature of phenomena to be like that of an apparition; they comprehended all worlds to be like dreams; they understood that the vision of all the tathāgatas is like an illusion; they knew all speech and sound to be like echoes; they had attained the knowledge that the creation of phenomena is like a magical manifestation; they had the excellent acquisition of aspirations; they possessed the skillfulness of the pure domain of wisdom; they had minds of complete peace, perfect peace; they possessed the field of wisdom of all the classes of dhāraṇīs; they had the complete prowess of the power of unfailing samādhi; they had the sight that has reached the limits of the nature of phenomena; they had attained the conduct that has no dependence on any phenomenon; they had traversed an endless ocean of wisdom; they had attained the strength and power of the perfection of wisdom; they had reached the highest state among all beings through their perfection of miraculous powers; they had attained dominion over the perfection of samādhi; they possessed the irreversible wisdom of being skillful in the goals of all the tathāgatas; they were wise in the methods of illuminating the treasure of the Dharma; they were learned in the knowledge of etymologies; they possessed the unceasing clouds of Dharma and the power of eloquence; they possessed the lion’s roar of the fearless bull; they had the joyous aspiration in the joy of phenomena having no basis; they saw all phenomena with undimmed sight; they were moons with the knowledge of the arising and destruction of worlds; they were disks of wisdom with the light rays that practiced all the ways of truth; they were turning wheels of the vajra merit of wisdom; they transcended all analogies; they were the growing sprouts of the wisdom that has power over all phenomena; they were the victory banners of heroes; they had the heroism that overthrows the banners of all the māras; they had the brilliance of the sun of infinite wisdom; they had bodies that transcended those of all beings; they had the unobscured knowledge of all phenomena; they had awakened to the knowledge that is the apex of all that is ceasing and unceasing; they were summit dwellers through having reached every summit; they had the sight of the knowledge that is attentive to the practice that has no features; they were skilled in the causes of the accomplishment of all bodhisattva conduct; they possessed the range of nondual wisdom; they discerned all the existences in worlds; there appeared to them the images of all the existences in buddha realms that have no locations; they were devoid of all the darkness of phenomena; they had reached the sun disks of wisdom that are free of darkness; they shined the radiance of the Dharma in every direction; they were the supreme fields of merit for all beings; they were moons of fruitful hearing, seeing, and aspiration; they were Sumerus of merit that had transcended all worlds; they were heroes who had vanquished the hosts of opponents; they made the sounds of their voices resound throughout all the buddha realms; they gazed insatiably upon the bodies of all the buddhas; they possessed the power of the appearance of the bodies of the buddhas; they magically manifested the bodies that were appropriate for guiding beings; they filled all the widespread realms with their one body; they had pure orbits of accomplishment; they were ships that are vehicles of great wisdom moving without impediment; they were orbs of wisdom that illuminated all the bodies in the realm of phenomena; they were suns of wisdom that rose over all beings; they had pleasing forms in accordance with the wishes of beings; they had the wisdom that discerned the motivations and faculties of all beings; they had attained the unobscured domain of all phenomena; they had understood the unborn nature of all phenomena; they had the mastery of uniting the minute and the vast; they had definitive knowledge of the profound way of buddhahood; they were skilled in profound meanings and the usage of terms; they communicated with unending words, terms, and meanings; they taught the entire ocean of sūtras condensed into one word; they had the miraculous power of a vast body of dhāraṇīs and wisdom; they had the power of possessing the mental retention of infinite kalpas; they had the wisdom that was aware, in one instant of mind, of dwelling in countless kalpas; they had the knowledge of all worlds through knowing the three times in one instant of mind; through the dhāraṇīs of the Dharma, they had the memory and eloquence of an endless ocean of the Buddhadharma; they unceasingly turned the Dharma wheel in accordance with their knowledge of all beings; they had attained the illumination through wisdom of the domain of the buddhas; they constantly remained in magnificent samādhi; they were at the unimpeded summit of being wise in the knowledge that differentiates between all phenomena; they disported themselves with wisdom within the domain of liberation that is superior to all phenomena; they had transformed all sense objects into excellent adornments; they had followed and entered every direction in the realm of phenomena; they had entered the realm of phenomena through all the different directions; they had awakened to enlightenment in the minute, in the vast, in atoms; their nature was colorless yet they manifested every color; they had brought together everything in one direction; they had an essence of wisdom and merit that developed infinite qualities and wisdom in one form; they were praised and eulogized by all the buddhas; and they described qualities and excellences with unceasing words and terms.

source: འཁོད་པ་དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་རྒྱ་མཚོ་ལ་འཇུག་པ། དེ་བཞིན་གཤེགས་པའི་འོད་ཟེར་གྱིས་རབ་ཏུ་སྣང་བར་གྱུར་པ། དེ་དག་གི་ལུས་ཐམས་ཅད་དང་། ཁང་པ་བརྩེགས་པ་དེ་དག་དང་།
en: The bodhisattvas who had gathered and were assembled in Jetavana had entered the ocean of the qualities of the Tathāgata and were illuminated by the light rays of the Tathāgata.

source: བྱང་ཆུབ་སེམས་དཔའི་ལོངས་སྤྱོད་དེ་དག་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྟན་དེ་དག་དང་། ཛེ་ཏའི་ཚལ་ཐམས་ཅད་ནས་ཀྱང་། དགའ་བ་ཆེན་པོའི་ཤུགས་རབ་ཏུ་ཐོབ་པའི་ཆོས་ཉིད་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཆོས་སྣང་བ་བསམ་གྱིས་མྱི་ཁྱབ་པ་རབ་ཏུ་ཐོབ་པས་དགའ་བའི་ཤུགས་ལས་བྱུང་བའི་རྣམ་པར་འཕྲུལ་པ་ཆེན་པོའི་རྒྱན་མངོན་པར་འཐོན་ནས། ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་རྒྱས་པ་ཁྱབ་པར་གྱུར་ཏོ། །འདི་ལྟ་སྟེ་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་འོད་ཟེར་གྱི་དྲ་བའི་སྤྲིན་ཤིན་ཏུ་ཡངས་པ། འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་ཚིམ་པར་བྱེད་པ་མངོན་པར་འཐོན་ཏེ། ཕྱོགས་བཅུ་རྒྱས་པ་ཁྱབ་པར་གྱུར་ཏོ། །
en: Through the nature of their attainment of great joy, and through their attainment of the inconceivable splendor of bodhisattva qualities, an array of miraculous manifestation that originated from great joy issued forth from all their bodies, the kūṭāgāras, the bodhisattva enjoyments, the bodhisattva thrones, and the entirety of Jetavana, and it spread throughout the entire realm of phenomena.

source: རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱི་དྲིལ་བུའི་སྤྲིན་མངོན་པར་འཐོན་ཏེ། དུས་གསུམ་གྱི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཡོན་ཏན་དང་ལེགས་པ་རབ་ཏུ་བརྗོད་པའི་སྤྲིན་གྱི་ང་རོ་རྗེས་སུ་བསྒྲགས་པས་ཕྱོགས་བཅུ་རྒྱས་པར་ཁྱབ་པར་གྱུར་ཏོ། །དམྱིགས་པ་ཐམས་ཅད་ལས་འགྲོ་བ་ཐམས་ཅད་རོལ་མོའི་སྤྲིན་མངོན་པར་འཐོན་ཏེ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལས་དང་རྣམ་པར་སྨིན་པ་རོལ་མོའི་སྒྲ་སྙན་པར་བླང་བས་རྗེས་སུ་སྒྲོག་ཅིང་ཕྱོགས་བཅུ་རྒྱས་པར་ཁྱབ་པར་གྱུར་ཏོ། །བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་སྣ་ཚོགས་ཡང་དག་པར་སྟོན་པའི་ཚུལ་གྱི་སྤྲིན་མང་པོ་མངོན་པར་འཐོན་ནས། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་གྱི་སྒྲ་དབྱངས་རབ་ཏུ་སྒྲོག་པས་ཕྱོགས་བཅུ་རྒྱས་པར་ཁྱབ་པར་གྱུར་ཏོ། །དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་སྤྲུལ་པ་དང་། རྣམ་པར་འཕྲུལ་བའི་སྤྲིན་མང་པོ་མངོན་པར་འཐོན་ནས། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་གསུང་གི་དབྱངས་རྗེས་སུ་རྗོད་ཅིང་། ཕྱོགས་བཅུ་རྒྱས་པར་ཁྱབ་པར་གྱུར་ཏོ། །བྱང་ཆུབ་སེམས་དཔའི་ལུས་མཚན་དང་དཔེ་བྱད་བཟང་པོས་རྣམ་པར་བརྒྱན་པའི་སྤྲིན་མང་པོ་མངོན་པར་འཐོན་ནས། ཞིང་ཐམས་ཅད་དུ་འབྱུང་བའི་སངས་རྒྱས་སྐྱེ་བ་གཅིག་ནས། གཅིག་ཏུ་བརྒྱུད་པ་རབ་ཏུ་བརྗོད་ཅིང་ཕྱོགས་བཅུ་རྒྱས་པར་ཁྱབ་པར་གྱུར་ཏོ། །དུས་གསུམ་གྱི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་དང་མཉམ་པའི་སྙིང་པོ་བྱང་ཆུབ་ཀྱི་སྤྲིན་མང་པོ་མངོན་པར་འཐོན་ནས། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མངོན་པར་བྱང་ཆུབ་པའི་རྒྱན་བྱུང་བ་ཡོངས་སུ་སྟོན་ཅིང་། ཕྱོགས་བཅུ་རྒྱས་པར་ཁྱབ་པར་གྱུར་ཏོ། །དམྱིགས་པ་ཐམས་ཅད་ལས་ཀླུའི་དབང་པོའི་ལུས་ཀྱི་སྤྲིན་མང་པོ་མངོན་པར་འཐོན་ནས། སྤོས་སྣ་ཚོགས་ཀྱི་ཆར་རབ་ཏུ་འབེབས་ཤིང་ཕྱོགས་བཅུ་རྒྱས་པར་ཁྱབ་པར་གྱུར་ཏོ། །འགྲོ་བ་ཐམས་ཅད་ཀྱི་དབང་པོའི་ལུས་དང་འདྲ་བའི་སྤྲིན་མང་པོ་མངོན་པར་འཐོན་ནས། བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་ཡོངས་སུ་བརྗོད་པ་བྱེད་ཅིང་། ཕྱོགས་བཅུ་རྒྱས་པར་ཁྱབ་པར་གྱུར་ཏོ། །ཞིང་ཡོངས་སུ་དག་པ་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་རང་བཞིན་ཡོངས་ཀྱི་གཟུགས་བརྙན་གྱི་སྤྲིན་མང་པོ་མངོན་པར་འཐོན་ནས། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་མངོན་པར་སྟོན་ཅིང་། ཕྱོགས་བཅུ་རྒྱས་པར་ཁྱབ་པར་གྱུར་ཏོ། །དེ་དག་ལ་སྩོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་གི་བྱིན་གྱི་རླབས་དང་། ཆོས་སྣང་བ་རྒྱ་མཚོ་བསམ་གྱིས་མྱི་ཁྱབ་པ་རབ་ཏུ་ཐོབ་པའི་ཆོས་ཉིད་ཀྱིས་རྒྱན་ཆེན་པོ་རྣམ་པར་སྤྲུལ་པའི་སྤྲིན་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མྱེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་བྱུང་བར་གྱུར་ཏོ། །
en: It was like this: in each instant of the mind there issued forth vast clouds of networks of light rays that brought satisfaction to all beings and pervaded the ten directions; there issued forth clouds of bells made of a variety of precious materials, from which resounded praises of the qualities and excellences of all the tathāgatas in the three times and which pervaded the ten directions; there issued forth from all sensory objects clouds of the music of all beings that possessed the beautiful sounds of the music of the ripening of the karma of all beings, and it resounded and pervaded throughout the ten directions; there issued forth a multitude of clouds that manifested all the ways of bodhisattva prayers and the variety of bodhisattva conduct, and they pervaded throughout the ten directions; they resounded with the sound of the prayers of all bodhisattvas and pervaded throughout the ten directions; there issued forth a multitude of clouds of the emanations and manifestations of all the tathāgatas, speaking with the voices of all the tathāgatas, which pervaded throughout the ten directions; there issued forth a multitude of clouds of the adorning characteristics and features of the bodies of bodhisattvas, which described the successive births of buddhas in all realms and pervaded throughout the ten directions; there issued forth a multitude of clouds of the enlightenment that is equally the essence of all the tathāgatas in the three times, and they taught the appearance of the array of the attainment of buddhahood by all the tathāgatas and pervaded throughout the ten directions; there issued forth a multitude of clouds of the bodies of the lords of nāgas from all sensory objects, which let fall a rain of various kinds of perfume and pervaded throughout the ten directions; there issued forth a multitude of clouds of bodies that resembled the lords of beings, described the completely good bodhisattva conduct, and pervaded the ten directions; there issued forth a multitude of clouds of images of the pure realms that had the nature of all precious materials, made visible the turning of the Dharma wheel by all tathāgatas, and pervaded the ten directions; and there issued forth other such clouds of vast arrays of miraculous manifestations as numerous as the atoms in buddha realms beyond enumeration through the transformative power of those bodhisattvas and from their nature of having attained the radiance of an inconceivable ocean of qualities.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་འཇམ་དཔལ་གྱིས་སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་རྣམ་པར་འཕྲུལ་པ་དེ་དག་ཡོངས་སུ་སྟོན་པ་བྱེད་ཅིང་ཕྱོགས་བཅུར་རྣམ་པར་བལྟས་ནས། དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །ཛེ་ཏའི་ཚལ་དུ་སངས་རྒྱས་བྱིན་གྱི་རླབས། །མཐའ་ཡས་རྒྱ་ཆེན་ཡོངས་སུ་བྱུང་ལ་ལྟོས། །
en: The bodhisattva Mañjuśrī, seeing in the ten directions all those manifestations of miracles through the miraculous power of the Buddha, recited these verses: “Observe the appearance of the vast, infinite, Miraculous power of the Buddha in Jetavana.

source: དམིགས་པ་ཀུན་ལས་ལུས་ཀྱི་སྤྲིན་ཆེན་རྣམས། །
en: There have issued forth from all sensory objects Clouds of bodies that have pervaded all directions.

source: མངོན་པར་མཐོན་ཅིང་ཕྱོགས་རྣམས་ཀུན་ཏུ་ཁྱབ། །བདེ་གཤེགས་སྲས་པོ་རྣམས་ཀྱི་སྣ་ཚོགས་རྒྱན། །ཁ་དོག་མཐའ་ཡས་རྒྱ་ཆེན་རྣམ་དག་པ། །སྟན་དང་དམྱིགས་པ་ཡོངས་སུ་བཅས་པ་ལ། །དེ་དག་ཐམས་ཅད་གཟུགས་བརྙན་འབྱུང་བ་སྣང་། །
en: {11} “The vast, completely pure, infinite forms Of the various displays of the Sugata’s offspring Are perceived as images appearing From the thrones and from sensory objects.

source: རྒྱན་རྣམས་སྣ་ཚོགས་རིན་ཆེན་འོད་འཕྲོའི་སྤྲིན། །བདེ་གཤེགས་སྲས་པོ་རྣམས་ཀྱི་སྤུ་རྩེ་ལས། །སངས་རྒྱས་གསུང་རྣམས་རབ་ཏུ་སྒྲོག་བྱེད་ཅིང་། །ཞིང་རྣམས་ཀུན་གྱི་དབྱིངས་སུ་ཁྱབ་པར་འཕྲོ། །
en: {12} “A variety of displays, clouds of jewel light rays, From the tips of the body hairs of the sons of the sugatas Are emanated, spreading within all the realms And resounding with the words of the buddhas.

source: ཚངས་པའི་དབང་པོའི་གཟུགས་འདྲ་ལུས་རྣམས་དང་། །སྤྱོད་ལམ་རབ་ཏུ་ཞི་བ་དག་པའི་གཟུགས། །ཞིང་གི་མེ་ཏོག་ཀུན་ལས་མངོན་འཐོན་ཏེ། །བསམ་གཏན་ཡན་ལག་བརྗོད་ཅིང་ཀུན་ཏུ་འདོང་། །
en: {13} “Bodies that resemble the forms of Brahmakāyika devas With pure bodies and peaceful conduct Issue forth from the blossoms on the trees, Describing the aspects of dhyāna as they go.

source: ཀུན་ཏུ་བཟང་པོ་འདྲ་བའི་རྒྱལ་བའི་སྲས། །མཚན་རབ་དཔེ་བྱད་བཟང་པོས་བརྒྱན་པའི་ལུས། །གྲངས་མྱེད་བསམ་ཡས་བདེ་གཤེགས་བ་སྤུ་ལས། །སྤྲུལ་པ་དེ་འདྲ་ཐོགས་པ་མྱེད་པར་འབྱུང་། །
en: {14} “From the Sugata’s pores issue forth, Without impediment, innumerable, countless emanations Who are bodhisattvas that resemble Samanta­bhadra, Their bodies adorned by the characteristics and features.

source: བདེ་གཤེགས་སྲས་པོ་དུས་གསུམ་བྱུང་བ་རྣམས། །ཡོན་ཏན་རྒྱ་མཚོའི་ལེགས་པ་བརྗོད་པ་དག །རྒྱ་མཚོ་ཆེ་མཉམ་རྒྱན་སྤྲིན་དེ་དག་ཀུན། །
en: {15} “The great ocean of the emanated qualities Of the sugatas’ sons who have appeared in the three times, Who are clouds of displays of an ocean of qualities, Proclaim those who are seated in Jetavana.

source: ཛེ་ཏའི་ཚལ་ན་གནས་ཤིང་རབ་ཏུ་བརྗོད། །ཕྱོགས་རྣམས་ཀུན་གྱི་སེམས་ཅན་ཡོངས་ཀྱི་ལས། །རྒྱ་མཚོ་ཆེན་པོ་སྣ་ཚོགས་མ་ལུས་པར། །ཛེ་ཏའི་ཚལ་གྱི་ཤིང་གི་གཟུགས་རྣམས་ཀྱི། གསེབ་ནས་བྱུང་བར་གྱུར་པ་ཀུན་ཏུ་གྲག །
en: {16} “A vast ocean of the variety, without exception, Of the karma of beings in all directions Is proclaimed, issuing forth from within The forms of the trees in Jetavana.

source: དུས་གསུམ་བྱུང་བའི་རྒྱལ་བ་ཐམས་ཅད་ཀྱི། །ཞིང་རྣམས་ཀུན་གྱི་མ་ལུས་རྣམ་འཕྲུལ་བ། །ཞིང་རྣམས་རྒྱ་མཚོའི་རྡུལ་སྙེད་དེ་དག་ཀྱང་། །སོ་སོའི་དམྱིགས་ཀྱིས་དམིགས་པར་གྱུར་པ་སྣང་། །
en: {17} “The miracles in all the realms, without exception, Of all the jinas who appear in the three times, Appear as each and every sensory object As numerous as the atoms in an ocean of realms.

source: སངས་རྒྱས་ཕྱོགས་ཀྱི་ཞིང་རྣམས་རྒྱ་མཚོའི་སྤྲིན། །སྤུ་རྩེ་རེ་རེར་སྣ་ཚོགས་རྣམ་ཕྱེ་བའི། །སངས་རྒྱས་གནས་རྣམས་སྐད་ཅིག་རེ་རེར་སྣང་། །དེ་དག་ལ་ཡང་སངས་རྒྱས་སྤྲིན་མང་བཞུགས། །
en: {18} “Clouds of oceans of buddhas in the realms in the directions Disseminate from each of their pore hairs, In each instant, a variety of the abodes of buddhas, Within which reside multitudes of clouds of buddhas.

source: འགྲོ་དང་མཉམ་པར་ཕྱོགས་རྣམས་ཀུན་བཀང་ཞིང་། །སེམས་ཅན་ཐབས་ཀྱིས་ཡོངས་སུ་སྨིན་པར་བྱེད། །
en: {19} “They pervade every direction, wherever there are beings, And through skillful methods ripen those beings.
